# FtSup2PerKip Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..FtSup2PerKip Property
SymbolTypeId Class See Also
---
Symbol ft²/kip, indicating unit Square feet per kip.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId FtSup2PerKip { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FtSup2PerKip As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FtSup2PerKip {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace